### Pandas Append Function 
Pandas append function is used to append rows of other dataframe to the end of the given dataframe,returning a new dataframe object.

Syntax: DataFrame.append()

Parameters: other,ignore_index,sort

In [3]:
import pandas as pd

In [7]:
df1=pd.DataFrame({'Name':['Abhi','Sham','Ram'],
             'Marks':[20,40,70]})
df2=pd.DataFrame({'Name':['Tej','Shreyash','Ramesh'],
             'Marks':[30,50,90]})
display(df1,df2)

   Name  Marks
0  Abhi     20
1  Sham     40
2   Ram     70

       Name  Marks
0       Tej     30
1  Shreyash     50
2    Ramesh     90

In [12]:
df1.append(df2)

       Name  Marks
0      Abhi     20
1      Sham     40
2       Ram     70
0       Tej     30
1  Shreyash     50
2    Ramesh     90

In [11]:
df1.append(df2,ignore_index=True)

       Name  Marks
0      Abhi     20
1      Sham     40
2       Ram     70
3       Tej     30
4  Shreyash     50
5    Ramesh     90

In [14]:
df2.append(df1,ignore_index=True)

       Name  Marks
0       Tej     30
1  Shreyash     50
2    Ramesh     90
3      Abhi     20
4      Sham     40
5       Ram     70

In [16]:
df3=pd.DataFrame({'Name':['Tej','Shreyash','Ramesh'],
             'Credit':[30,50,90]})
df3

       Name  Credit
0       Tej      30
1  Shreyash      50
2    Ramesh      90

In [19]:
df1.append(df3,sort=False)

       Name  Marks  Credit
0      Abhi   20.0     NaN
1      Sham   40.0     NaN
2       Ram   70.0     NaN
0       Tej    NaN    30.0
1  Shreyash    NaN    50.0
2    Ramesh    NaN    90.0